In [1]:
import pandas as pd

In [8]:
df = pd.read_excel('matching.xlsx', skiprows=2, nrows=5000)

In [9]:
df.head()

,Employer,Employer City,Employer Representative,Unnamed: 3,NEW Employer
0,4,CLEVELAND,JOSEPH E PREKOP,NaN,NaN
1,NOV,DAYTON,"Schmidt, Lisa",NaN,NaN
2,1,(blank),(blank),NaN,NaN
3,NaN,WEST PALM BEACH,NaN,NaN,NaN
4,Aberdeen Health Mart,ABERDEEN,"Quinby, Christopher",NaN,NaN

In [10]:
df_2 = df.sort_values(by='Employer')

In [12]:
df_2.head()

,Employer,Employer City,Employer Representative,Unnamed: 3,NEW Employer
4,Aberdeen Health Mart,ABERDEEN,"Quinby, Christopher",NaN,NaN
8,AMSCOR INC.,BROOKLYN,"Silberglied, Scott",NaN,NaN
5,Alstom,LENEXA,"Herzog , Dave",NaN,NaN
6,"Ambassador, fka, Moroun",DETROIT,"Moroun, John",NaN,NaN
9,Arizona Opera Company,TUCSON,"Provost, Doug",NaN,NaN

In [13]:
df_2.to_excel('dummy.xlsx')

In [19]:
df_2['Employer'] = df_2['Employer'].astype(str).apply(lambda st: st.strip(' '))

In [20]:
for d in df_2[]

4          Aberdeen Health Mart
8                   AMSCOR INC.
5                        Alstom
6       Ambassador, fka, Moroun
9         Arizona Opera Company
                 ...
4995                        nan
4996                        nan
4997                        nan
4998                        nan
4999                        nan
Name: Employer, Length: 5000, dtype: object